posts/nix-learning.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-01 Mon 16:40 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nix Learning</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Nix Learning</h1>
</header>
<div id="outline-container-org5bfea97" class="outline-2">
<h2 id="org5bfea97">Nobody can Explain&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span>&#xa0;<span class="resources">resources</span>&#xa0;<span class="nixos">nixos</span></span></h2>
<div class="outline-text-2" id="text-org5bfea97">
<p>
NixOS is definitely an advanced Linux distro, but it ain&rsquo;t easy to understand overnight or like Archlinux to have easy manual, but it sure has alot on the table. There is whole bunch of families like Nix functional language, Nix package manager&#x2026; so and on with the prefix &ldquo;nix&rdquo;.
</p>

<p>
This is really confusing, many hate nix and are not convinced to go long run just because of this difficulty (mess?). To make a simple thing work as expected, you need to go through such a rabbit hole.
But once you know Nix* (families), everything will make sense, and you would feel bad to go back to old traditional Linux manners.
</p>

<p>
These are some of the learning resources, which are rich in content and nonetheless, will be confusing at some point. But engineers do have spared their time in writing these, taking actions, to reach some audience and solve some of the caveats of Nix. So dig through and learn new ;)
</p>
</div>

<div id="outline-container-org49c3337" class="outline-3">
<h3 id="org49c3337">nix-learning</h3>
<div class="outline-text-3" id="text-org49c3337">
</div>
<div id="outline-container-orgfe3f223" class="outline-4">
<h4 id="uncategorized">Uncategorized</h4>
<div class="outline-text-4" id="text-uncategorized">
<ul class="org-ul">
<li><a href="https://youtu.be/m4sv2M9jRLg">Nix Fundamentals</a> (Video)</li>
<li><a href="https://stephank.nl/p/2020-06-01-a-nix-primer-by-a-newcomer.html">A Nix terminology primer by a newcomer</a> - Stéphan Kochen</li>
<li><a href="https://shopify.engineering/what-is-nix">What Is Nix</a></li>
<li><a href="https://nasirhm.github.io/posts/getting-started-with-nix-introduction/">Getting Started With Nix: Introduction</a> - Nasir Hussain</li>
<li><a href="https://blog.sulami.xyz/posts/nix-for-developers/">Lightning
Introduction to Nix for Developers</a> - Robin Schroer</li>
<li><a href="https://blog.knightsofthelambdacalcul.us/posts/2020-06-20-nix-nixos-thoughts/">Nix(OS)
Thoughts</a> - ?</li>
<li><a href="https://fzakaria.com/2020/11/17/on-demand-linked-libraries-for-nix.html">On-demand
linked libraries for Nix</a> - Farid Zakaria</li>
<li><a href="https://serokell.io/blog/what-is-nix">What Is Nix and Why You Should
Use It</a> - ?</li>
<li><a href="https://push.cx/2018/nixos">NixOS on prgmr and Failing to Learn
Nix</a> - Peter Bhat Harkins</li>
<li><a href="https://www.tweag.io/blog/2020-09-10-nix-cas/">Towards a
content-addressed model for Nix</a> - Théophane Hufschmitt</li>
<li><a href="https://lucperkins.dev/blog/nix-channel/">The easiest way (I&rsquo;ve
found) to create your own Nix channel</a> - Luc Perkins</li>
<li><a href="https://www.johnbcoughlin.com/posts/nix-dynamic-linking/">Debugging
a dynamic linking bug in a Nix project</a> - Jack Coughlin</li>
<li><a href="https://notes.neeasade.net/adhoc-executable-patching-on-nix.html">adhoc
executable patching on nixos</a> - ?</li>
<li><a href="https://maxmcd.com/posts/strategies-for-binary-relocation/">Strategies
for Binary Relocation In Functional Build Systems</a> - Max McDonnell</li>
<li><a href="https://christine.website/blog/how-i-start-nix-2020-03-08">How I
Start: Nix</a> - Christine Dodrill</li>
<li><a href="https://christine.website/blog/i-was-wrong-about-nix-2020-02-10">I
was Wrong about Nix</a> - Christine Dodrill</li>
<li><a href="https://www.infoq.com/articles/configuration-management-with-nix/">Purely
Functional Configuration Management with Nix and NixOS</a> - Eelco
Dolstra</li>
<li><a href="https://bgottlob.com/post/2019-05-29-nix-use-cases/">Basic Use-Cases
of the Nix Package Manager</a> - Brandon Gottlob</li>
<li><a href="https://thomazleite.com/posts/development-with-nix-python/">Development
with Nix: Python</a> - Thomaz Leite</li>
<li><a href="https://medium.com/dapphub/dapp-tools-and-the-nix-package-manager-c4c692c87310">Dapp
tools and the Nix package manager</a> - Mikael Brockman</li>
<li><a href="http://gfxmonk.net/2015/01/03/nixos-and-stateless-deployment.html">NixOS
and Stateless Deployment</a> - ?</li>
<li><a href="https://christine.website/blog/nixos-encrypted-secrets-2021-01-20">Encrypted
Secrets with NixOS</a> - Christine Dodrill</li>
<li><a href="https://begriffs.com/posts/2016-08-08-intro-to-nixos.html">Purely
Functional Linux with NixOS</a> - Joe Nelson</li>
<li><a href="https://www.tweag.io/blog/2018-03-15-bazel-nix/">Nix + Bazel = fully
reproducible, incremental builds</a> - Mathieu Boespflug, Théophane
Hufschmitt</li>
<li><a href="https://zenhack.net/2016/01/24/reflections-on-nixos.html">Reflections
On NixOS</a> - Ian Denhardt</li>
<li><a href="https://blog.mayflower.de/5800-Hardening-Compiler-Flags-for-NixOS.html">Hardening
Compiler Flags for NixOS</a> - Franz Pletz</li>
<li><a href="https://hugoreeves.com/posts/2019/nix-home/">Your home in Nix
(dotfile management)</a> - Hugo Reeves</li>
<li><a href="https://christine.website/blog/nixos-desktop-flow-2020-04-25">My
NixOS Desktop Flow</a> - Christine Dodrill</li>
<li><a href="https://tailscale.com/blog/nixos-minecraft/">Tailscale on NixOS: A
new Minecraft server in ten minutes</a> - Christine Dodrill</li>
<li><a href="https://terinstock.com/post/2021/01/Setting-up-a-git-server-on-NixOS/">Setting
up a git server on NixOS</a> - Terin Stock</li>
<li><a href="https://myme.no/posts/2020-01-26-nixos-for-development.html">NixOS:
For developers</a> - Martin Myrseth</li>
<li><a href="https://myme.no/posts/2019-07-01-nixos-into-the-deep-end.html">NixOS:
Into the deep end</a> - Martin Myrseth</li>
<li><a href="https://rgoswami.me/posts/ccon-tut-nix/">A Tutorial Introduction to
Nix</a> - Rohit Goswami</li>
<li><a href="https://zimbatm.com/benchmark-nixpkgs">Benchmarking nixpkgs
builds</a> - Jonas Chevalier</li>
<li><a href="https://zimbatm.com/experiment-recursive-nix">Recursive Nix
experiment</a> - Jonas Chevalier</li>
<li><a href="https://zimbatm.com/deploying-k8s-apps-with-kubenix">Deploying
Kubernetes apps with KubeNix</a> - Jonas Chevalier</li>
<li><a href="https://github.com/tazjin/nix-1p">Nix - A One Pager</a> - Vincent Ambo</li>
<li><a href="https://foo-dogsquared.github.io/blog/posts/moving-into-nixos/">Moving
into NixOS</a> - Gabriel Arazas</li>
<li><a href="https://www.willghatch.net/blog/2020/06/27/nixos-the-good-the-bad-and-the-ugly/">NixOS:
the good, the bad, and the ugly</a> - William G Hatch</li>
<li><a href="https://www.nmattia.com/posts/2018-03-21-nix-reproducible-setup-linux-macos.html">Nix:
A Reproducible Setup for Linux and macOS</a> - Nicolas Mattia</li>
<li><a href="https://www.nmattia.com/posts/2019-01-15-easy-peasy-nix-versions.html">Easy
Peasy Nix Versions</a> - Nicolas Mattia</li>
<li><a href="https://www.nmattia.com/posts/2019-10-08-runtime-dependencies">Recovering
Nix derivation attributes of runtime dependencies</a> - Nicolas Mattia</li>
</ul>

<div class="html">
<p>
&lt;!&#x2013; TODO: add more from their website &#x2013;&gt;
</p>

</div>

<ul class="org-ul">
<li><a href="https://ops.functionalalgebra.com/nix-by-example/">Nix By
Example</a> - Susan Potter</li>
<li><a href="https://ops.functionalalgebra.com/nixops-by-example/">NixOps By
Example</a> - Susan Potter</li>
<li><a href="https://ops.functionalalgebra.com/nixos-by-example/">NixOS By
Example</a> - Susan Potter</li>
<li><a href="https://ops.functionalalgebra.com/2018/04/18/inspecting-nix-lambda-named-arguments/">Inspecting
Nix lambda function named arguments</a> - Susan Potter</li>
</ul>

<div class="html">
<p>
&lt;!&#x2013; TODO: add Tweag Nix flakes &#x2013;&gt;
</p>

</div>
</div>
</div>

<div id="outline-container-orgfd3dd92" class="outline-4">
<h4 id="overview">Overview</h4>
<div class="outline-text-4" id="text-overview">
<ul class="org-ul">
<li><a href="https://web.archive.org/web/20210123223258/https://ebzzry.io/en/nix/">A
Gentle Introduction to the Nix Family</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb1d30cd" class="outline-4">
<h4 id="nix-the-language">Nix the language</h4>
<div class="outline-text-4" id="text-nix-the-language">
<ul class="org-ul">
<li><a href="https://nixcloud.io/tour">A tour of Nix</a> - an introduction to the
Nix Programming Language</li>
</ul>
</div>
</div>

<div id="outline-container-orge9cbc8b" class="outline-4">
<h4 id="nix-shell">Nix Shell</h4>
<div class="outline-text-4" id="text-nix-shell">
<ul class="org-ul">
<li><a href="https://ghedam.at/15978/an-introduction-to-nix-shell">An
introduction to nix-shell</a> - Mattia Gheda</li>
<li><a href="https://fzakaria.com/2020/08/11/caching-your-nix-shell.html">caching
your nix-shell</a> - Farid Zakaria</li>
</ul>
</div>
</div>

<div id="outline-container-org96bb5b4" class="outline-4">
<h4 id="nix-flakes">Nix Flakes</h4>
<div class="outline-text-4" id="text-nix-flakes">
<ul class="org-ul">
<li><a href="https://blog.ysndr.de/posts/internals/2021-01-01-flake-ification/">Building
with Nix Flakes for, eh .. reasons!</a> - Yannik Sander</li>
<li><a href="https://zimbatm.com/NixFlakes/">Nix Flakes edition</a> - Jonas
Chevalier</li>
</ul>
</div>
</div>

<div id="outline-container-orgd7878d7" class="outline-4">
<h4 id="experience">Experience</h4>
<div class="outline-text-4" id="text-experience">
<ul class="org-ul">
<li><a href="https://catgirl.ai/log/nixos-experience/">Eight Months of NixOS</a> -
ash</li>
<li><a href="https://tech.channable.com/posts/2021-04-09-nix-is-the-ultimate-devops-toolkit.html">Nix
is the ultimate DevOps toolkit</a> - Ruud van Asseldonk, Reinier Maas,
Falco Peijnenburg, Fabian Thorand, and Robert Kreuzer</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5c9e9d" class="outline-4">
<h4 id="language-specific">Language Specific</h4>
<div class="outline-text-4" id="text-language-specific">
</div>
<ul class="org-ul">
<li><a id="java"></a>Java<br>
<div class="outline-text-5" id="text-java">
<ul class="org-ul">
<li><a href="https://fzakaria.com/2020/07/20/packaging-a-maven-application-with-nix.html">Packaging
a Maven application with Nix</a></li>
</ul>
</div>
</li>

<li><a id="elixir"></a>Elixir<br>
<div class="outline-text-5" id="text-elixir">
<ul class="org-ul">
<li><a href="https://ejpcmac.net/blog/using-nix-in-elixir-projects/">Using Nix in
Elixir projects</a> - Jean-Philippe</li>
</ul>
</div>
</li>

<li><a id="c"></a>C++<br>
<div class="outline-text-5" id="text-c">
<ul class="org-ul">
<li><a href="https://blog.galowicz.de/2019/04/17/tutorial_nix_cpp_setup/">Setting
up a C++ project environment with nix</a> - Jacek Galowicz</li>
</ul>
</div>
</li>

<li><a id="rust"></a>Rust<br>
<div class="outline-text-5" id="text-rust">
<ul class="org-ul">
<li>Managing Rust Dependencies with Nix - James Kay
<ul class="org-ul">
<li><a href="https://hadean.com/blog/managing-rust-dependencies-with-nix-part-i/">Part
1</a></li>
<li><a href="https://hadean.com/blog/managing-rust-dependencies-with-nix-part-ii/">Part
2</a></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org75c88d9" class="outline-4">
<h4 id="series">Series</h4>
<div class="outline-text-4" id="text-series">
<ul class="org-ul">
<li>Nix by Example - James Fisher
<ul class="org-ul">
<li><a href="https://medium.com/@MrJamesFisher/nix-by-example-a0063a1a4c55">Part
1: The Nix expression language</a></li>
</ul></li>
<li>Ian Henry&rsquo;s <i>How to Learn Nix</i> series
<ul class="org-ul">
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/introduction/">Part
1: What&rsquo;s all this about?</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/prior-knowledge/">Part
2: Prior knowledge</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/glossary/">Part 3:
What we talk about when we talk about Nix</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/quick-start-guide/">Part
4: Quick starts, full hearts</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/basic-package-management/">Part
5: Basic package management</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/profiles/">Part 6:
Profiles</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/garbage-collection/">Part
7: Garbage collection</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/channels/">Part 8:
Channels</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/sharing/">Part 9:
Learning to share</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/my-first-derivation/">Part
10: My first derivation</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/okay-my-actual-first-derivation/">Part
11: Okay my actual first derivation</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/nix-language/">Part
12: The Nix expression language</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/derivations/">Part
13: Derivations</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/built-in-functions/">Part
14: Built-in Functions</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/advanced-topics/">Part
15: Advanced Topics</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/command-reference/">Part
16: Command Reference</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/configuration/">Part
17: Configuration</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/nix-manual-reflection/">Part
18: So I read the manual huh</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/switching-from-homebrew-to-nix/">Part
19: Switching from Homebrew to Nix</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/my-first-nix-bug/">Part
20: My first Nix bug</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/my-first-package-upgrade/">Part
21: My first package upgrade</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/declarative-user-environment/">Part
22: Setting up a declarative user environment</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/how-to-learn-nixpkgs/">Part
23: How to learn Nixpkgs</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/overlays/">Part 24:
Overlays</a></li>
<li><a href="https://ianthehenry.com/posts/how-to-learn-nix/overriding/">Part
25: Overriding</a></li>
</ul></li>
</ul>

<hr>

<p>
These links are extracted from humancalico&rsquo;s git repo (<a href="https://github.com/humancalico/nix-learning">https://github.com/humancalico/nix-learning</a>).
</p>

<div class="org-center">
<p>
With that sorted, I hope learning becomes good ;)
</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<!-- <p class="date" id="content" align="left" style="font-size:0.8em;">Posted on: 2023-05-03 Wed 00:00 -->
<!--   <br> -->
<!--  Updated on: 2024-01-01 Mon 16:39 -->
<!-- </p> -->

<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
 2023 - 2024 <b>Dilip</b>  Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
